app/controllers/moves_controller.rb

SELECT  "move_types".* FROM "move_types" WHERE "move_types"."name" = ? LIMIT ?  [["name", "Purchase"], ["LIMIT", 1]]
---
  def create
    @move_type = MoveType.find_by name: 'Purchase'